# Ultralytics YOLOv8, P2–P5 heads + P1→P2 context
nc: 10
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 P2/4
  - [-1, 4, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 P4/16
  - [-1, 8, C2f, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 P5/32
  - [-1, 4, C2f, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 10
  - [[-1, 6], 1, Concat, [1]]                       # 11
  - [-1, 2, C2f, [512]]                              # 12 (P4)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 13
  - [[-1, 4], 1, Concat, [1]]                       # 14
  - [-1, 2, C2f, [256]]                              # 15 (P3)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 16 (to P2)
  - [0, 1, Conv, [128, 3, 2]]                        # 17 P1 to P2
  - [[16, 2, 17], 1, Concat, [1]]                    # 18 cat(P2 up, P2 skip, P1 to P2)
  - [-1, 2, C2f, [128]]                              # 19 (P2)
  - [-1, 1, Conv, [256, 3, 2]]                       # 20
  - [[-1, 15], 1, Concat, [1]]                       # 21
  - [-1, 2, C2f, [256]]                              # 22 (P3)
  - [-1, 1, Conv, [512, 3, 2]]                       # 23
  - [[-1, 12], 1, Concat, [1]]                       # 24
  - [-1, 2, C2f, [512]]                              # 25 (P4)
  - [-1, 1, Conv, [1024, 3, 2]]                      # 26
  - [[-1, 9], 1, Concat, [1]]                        # 27
  - [-1, 1, C2f, [1024]]                             # 28 (P5)
  - [[19, 22, 25, 28], 1, Detect, [nc]]
